lib/tasks/cleanup_rooms.rake

SELECT "game_rooms".* FROM "game_rooms"
---
  task cleanup: :environment do
    puts "Cleaning up old empty rooms..."
    rooms_to_delete = GameRoom.all.select { |room| room.should_be_cleaned_up? }