app/views/game/join_room.html.erb

        <div class="flex items-center justify-between mb-3">
          <h3 class="text-lg font-semibold">Players in Room (<%= @game_room.players.count %>/<%= @game_room.max_players %>)</h3>
---
SELECT "players".* FROM "players" WHERE "players"."game_room_id" = 1
SELECT COUNT(*) FROM "players" WHERE "players"."game_room_id" = 3

        <div class="space-y-2">
          <% @game_room.players.each do |player| %>
---
SELECT "players".* FROM "players" WHERE "players"."game_room_id" = 3