app/views/game/multiplayer.html.erb

      <h3 class="text-lg font-bold mb-4 text-center">Current Active Rooms</h3>
      <% active_rooms = GameRoom.all %>
---
SELECT "game_rooms".* FROM "game_rooms"