app/views/game/room.html.erb

SELECT "players".* FROM "players" WHERE "players"."game_room_id" = 3 ORDER BY "players"."id" ASC LIMIT 1
SELECT COUNT(*) FROM "players" WHERE "players"."game_room_id" = 3
---
          <p class="text-sm text-gray-500">Status: <span class="font-medium text-green-600"><%= (@game_room.status || 'waiting').titleize %></span></p>
          <p class="text-sm text-gray-500">Players: <%= @game_room.players.count %>/<%= @game_room.max_players %></p>

SELECT "players".* FROM "players" WHERE "players"."game_room_id" = 31 ORDER BY "players"."id" ASC LIMIT 1
---
                <div class="flex gap-4">
                  <% if @game_room.can_start? && @game_room.players.first == @player %>

SELECT "players".* FROM "players" WHERE "players"."game_room_id" = 31
---
          <div id="players-list" class="space-y-3">
            <% @game_room.players.each do |player| %>