app/views/game/waiting_room.html.erb

SELECT "players".* FROM "players" WHERE "players"."game_room_id" = 3 AND "players"."id" = 1 LIMIT 1
SELECT COUNT(*) FROM "players" WHERE "players"."game_room_id" = 3
---
        <div class="flex items-center justify-between mb-3">
          <h3 class="text-lg font-semibold">Players in Room (<%= @game_room.players.count %>/<%= @game_room.max_players %>)</h3>

SELECT "players".* FROM "players" WHERE "players"."game_room_id" = 3
---
        <div class="grid grid-cols-1 md:grid-cols-2 gap-3">
          <% @game_room.players.each do |player| %>