app/controllers/game_controller.rb

  def create_room
    @game_room = GameRoom.new(game_room_params)
    if @game_room.save
---
INSERT INTO "game_rooms" ("name", "room_code", "max_players", "status", "created_at", "updated_at") VALUES ('test room', 'AOZYHJ', 2, NULL, '2025-06-27 17:20:36.350604', '2025-06-27 17:20:36.350604') RETURNING "id"

  def join_room
    @game_room = GameRoom.find_by(room_code: params[:room_code])
---
SELECT "game_rooms".* FROM "game_rooms" WHERE "game_rooms"."room_code" = 'AOZYHJ' LIMIT 1

  def join_game
    @game_room = GameRoom.find_by!(room_code: params[:room_code])

    Rails.logger.info "Join game attempt for room: #{@game_room.name}"
    Rails.logger.info "Room current players: #{@game_room.players.count}"
    Rails.logger.info "Room max players: #{@game_room.max_players}"
    Rails.logger.info "Player params: #{player_params}"

    if @game_room.full?
      Rails.logger.info "Room is full, redirecting"
      redirect_to join_room_path(@game_room.room_code), alert: "Room is full!"
      return
    end

    @player = @game_room.players.new(player_params)

    Rails.logger.info "Player valid? #{@player.valid?}"
    Rails.logger.info "Player errors: #{@player.errors.full_messages}" unless @player.valid?

    if @player.save
---
SELECT "game_rooms".* FROM "game_rooms" WHERE "game_rooms"."room_code" = 'FIQVEZ' LIMIT 1
SELECT COUNT(*) FROM "players" WHERE "players"."game_room_id" = 5
INSERT INTO "players" ("game_room_id", "name", "score", "created_at", "updated_at") VALUES (5, 'chris2', 0, '2025-06-27 17:39:14.702857', '2025-06-27 17:39:14.702857') RETURNING "id"

  def waiting_room
    @game_room = GameRoom.find_by!(room_code: params[:room_code])
    @player = @game_room.players.find(params[:player_id])
---
SELECT "game_rooms".* FROM "game_rooms" WHERE "game_rooms"."room_code" = 'FIQVEZ' LIMIT 1
SELECT "players".* FROM "players" WHERE "players"."game_room_id" = 5 AND "players"."id" = 4 LIMIT 1

  def room
    @game_room = GameRoom.find_by!(room_code: params[:room_code])

    if params[:player_id]
      @player = @game_room.players.find(params[:player_id])
---
SELECT "game_rooms".* FROM "game_rooms" WHERE "game_rooms"."room_code" = 'FIQVEZ' LIMIT 1
SELECT "game_rooms".* FROM "game_rooms" WHERE "game_rooms"."room_code" = 'F9PALD' LIMIT 1
SELECT "players".* FROM "players" WHERE "players"."game_room_id" = 5 AND "players"."id" = 3 LIMIT 1

  def start_game
    @game_room = GameRoom.find_by!(room_code: params[:room_code])

    if @game_room.can_start?
      @game_room.update!(status: "playing")
---
SELECT "game_rooms".* FROM "game_rooms" WHERE "game_rooms"."room_code" = 'FIQVEZ' LIMIT 1
UPDATE "game_rooms" SET "status" = 'playing', "updated_at" = '2025-06-27 17:42:16.475614' WHERE "game_rooms"."id" = 5

  def game_status
    @game_room = GameRoom.find_by!(room_code: params[:room_code])

    Rails.logger.info "Game status check for room: #{@game_room.name}"
    Rails.logger.info "Room status: #{@game_room.status}"
    Rails.logger.info "Players count: #{@game_room.players.count}"

    response_data = {
      status: @game_room.status || "waiting",
      players_count: @game_room.players.count,
      max_players: @game_room.max_players,
      can_start: @game_room.can_start?
---
SELECT "game_rooms".* FROM "game_rooms" WHERE "game_rooms"."room_code" = 'FIQVEZ' LIMIT 1
SELECT COUNT(*) FROM "players" WHERE "players"."game_room_id" = 7
SELECT "game_rooms".* FROM "game_rooms" WHERE "game_rooms"."name" = 'test room'
SELECT "players".* FROM "players" WHERE "players"."game_room_id" = 3

  def get_board
    @room = GameRoom.find_by(room_code: params[:room_code])
    @player = @room.players.find(params[:player_id])
---
SELECT "game_rooms".* FROM "game_rooms" WHERE "game_rooms"."room_code" = 'AIWPUO' LIMIT 1
SELECT "players".* FROM "players" WHERE "players"."game_room_id" = 13 AND "players"."id" = 17 LIMIT 1

  def cleanup_rooms
    # More aggressive cleanup for testing
    rooms_deleted = GameRoom.cleanup_old_rooms

    # Delete all rooms if requested
    if params[:delete_all]
      all_deleted = GameRoom.destroy_all.count
      rooms_deleted += all_deleted
    end

    # Also delete rooms with specific names for testing (keeping for backward compatibility)
    if params[:force_delete_name]
      force_deleted = GameRoom.where(name: params[:force_delete_name]).destroy_all.count
---
DELETE FROM "game_rooms" WHERE "game_rooms"."id" = 8
DELETE FROM "game_rooms" WHERE "game_rooms"."id" = 17

  def collect_apples
    @room = GameRoom.find_by(room_code: params[:room_code])
    @player = @room.players.find(params[:player_id])
---
SELECT "game_rooms".* FROM "game_rooms" WHERE "game_rooms"."room_code" = 'NTBCRB' LIMIT 1
SELECT "game_rooms".* FROM "game_rooms" WHERE "game_rooms"."room_code" = 'IVFRPB' LIMIT 1
SELECT "players".* FROM "players" WHERE "players"."game_room_id" = 25 AND "players"."id" = 42 LIMIT 1

  def player_finished
    @room = GameRoom.find_by(room_code: params[:room_code])
    @player = @room.players.find(params[:player_id])

    # Get player's current game state
    player_state = PlayerGameState.current_state(@player.id, params[:room_code])

    if player_state
      # Mark player as finished
      player_state.update(finished: true, final_score: player_state.score)

      # Check if all players are finished
      all_players_finished = @room.players.all? do |player|
        state = PlayerGameState.current_state(player.id, params[:room_code])
        state&.finished
      end

      if all_players_finished
        # Mark room as finished
        @room.update(status: "finished")
---
SELECT "game_rooms".* FROM "game_rooms" WHERE "game_rooms"."room_code" = '57JTJD' LIMIT 1
SELECT "players".* FROM "players" WHERE "players"."game_room_id" = 24 AND "players"."id" = 39 LIMIT 1
UPDATE "game_rooms" SET "status" = 'finished', "updated_at" = '2025-06-27 19:06:03.046292' WHERE "game_rooms"."id" = 23
UPDATE "player_game_states" SET "updated_at" = '2025-06-27 19:13:33.336219', "finished" = 1, "final_score" = 0 WHERE "player_game_states"."id" = 14
SELECT "game_rooms".* FROM "game_rooms" WHERE "game_rooms"."room_code" = 'GL1HHQ' LIMIT 1
SELECT "players".* FROM "players" WHERE "players"."game_room_id" = 23 AND "players"."id" = 38 LIMIT 1
UPDATE "game_rooms" SET "status" = 'finished', "updated_at" = '2025-06-27 19:13:33.342205' WHERE "game_rooms"."id" = 24

  def request_new_board
    @room = GameRoom.find_by(room_code: params[:room_code])
    @player = @room.players.find(params[:player_id])

    # Get player's current game state
    player_state = PlayerGameState.current_state(@player.id, params[:room_code])

    if player_state
      # Check if this player has already requested a new board
      if player_state.needs_new_board
        # Player already requested, check if there's a newer board available
        current_board = GameBoard.current_board(params[:room_code])
        newer_board = GameBoard.where(room_code: params[:room_code])
                              .where("created_at > ?", current_board.created_at)
                              .order(created_at: :desc)
                              .first

        if newer_board
          # Newer board available, create new game states for all players (preserving scores)
          new_player_states = []
          @room.players.each do |player|
---
SELECT "game_rooms".* FROM "game_rooms" WHERE "game_rooms"."room_code" = 'PGWKDS' LIMIT 1
SELECT "players".* FROM "players" WHERE "players"."game_room_id" = 26 AND "players"."id" = 44 LIMIT 1
SELECT "game_boards".* FROM "game_boards" WHERE "game_boards"."room_code" = 'PGWKDS' AND (created_at > '2025-06-27 19:16:56.363112') ORDER BY "game_boards"."created_at" DESC LIMIT 1
SELECT "game_rooms".* FROM "game_rooms" WHERE "game_rooms"."room_code" = '57JTJD' LIMIT 1
SELECT "players".* FROM "players" WHERE "players"."game_room_id" = 24 AND "players"."id" = 39 LIMIT 1