app/models/game_room.rb

SELECT "game_rooms".* FROM "game_rooms"
DELETE FROM "game_rooms" WHERE "game_rooms"."id" = 19
---
  def self.cleanup_old_rooms
    rooms_to_delete = all.select { |room| room.should_be_cleaned_up? }
    count = rooms_to_delete.count

    if count > 0
      Rails.logger.info "Cleaning up #{count} rooms: #{rooms_to_delete.map(&:name).join(', ')}"
      where(id: rooms_to_delete.map(&:id)).destroy_all