app/models/game_board.rb

  def self.current_board(room_code)
    where(room_code: room_code).order(created_at: :desc).first
---
SELECT "game_boards".* FROM "game_boards" WHERE "game_boards"."room_code" = 'AIWPUO_player_17' ORDER BY "game_boards"."created_at" DESC LIMIT 1