app/models/player_game_state.rb

  def self.current_state(player_id, room_code)
    where(player_id: player_id, room_code: room_code).order(created_at: :desc).first
---
SELECT "player_game_states".* FROM "player_game_states" WHERE "player_game_states"."player_id" = 27 AND "player_game_states"."room_code" = 'I1FVBB' ORDER BY "player_game_states"."created_at" DESC LIMIT 1